# -*- coding:utf-8 -*-
"""
date: 2026/02/01
author: Berserker
"""

hq_hosts = [
    ("国投证券上海联通", "220.203.236.11", 7709, False),
    ("通达信接入主站1", "101.35.247.235", 7709, True),
    ("通达信接入主站2", "111.229.200.45", 7709, True),
    ("通达信上海电信1", "180.153.18.170", 7709, False),
    ("国投证券科技园电信1", "121.14.104.152", 7709, False),
    ("国投证券上海2", "101.230.126.29", 7709, False),
    

]

ex_hq_hosts = [
    ("科技园电信1", "113.96.40.130", 7721, False),
    ("科技园联通1", "58.250.179.11", 7721, False),
    ("东莞电信1", "59.36.5.12", 7721, False),
    ("东莞联通1", "112.93.132.12", 7721, False),
    ("中信青岛", "221.0.195.48", 7721, False),
    ("pytdx", "180.153.18.176", 7721, False),
    ("期货扩展行情主站1", "39.108.101.114", 7727, True),
    ("期货扩展行情主站2", "47.103.120.159", 7727, True),
    
    # ("华安证券-香港", "112.74.214.43", 7727, True),
]

